spec-review/optional-has-value/5-mutations/optional_mutations_m_terra__invert_has_value.patch
diff --git a/proof/optional/spec.v b/proof/optional/spec.v
--- a/proof/optional/spec.v
+++ b/proof/optional/spec.v
@@ -189 +189 @@ Section with_cpp.
-      \post[Vbool (is_engaged state)] emp.
+      \post[Vbool (negb (is_engaged state))] emp.
