spec-review/optional-has-value/5-mutations/optional_mutations_m_terra__zero_value_absent.patch
diff --git a/proof/optional/model.v b/proof/optional/model.v
--- a/proof/optional/model.v
+++ b/proof/optional/model.v
@@ -17 +17 @@ Definition is_engaged (state : optional_state) : bool :=
-  | Some _ => true
+  | Some value => negb (Z.eqb value 0)
@@ -21 +21 @@ Succeed Example is_engaged_none : is_engaged None = false := eq_refl.
-Succeed Example is_engaged_zero : is_engaged (Some 0) = true := eq_refl.
+Succeed Example is_engaged_zero : is_engaged (Some 0) = false := eq_refl.
